Enhancments and bug fixes
